app/controllers/admin/color_themes_controller.rb

    def index
      authorize! :index, ColorTheme

      @color_themes = ColorTheme.accessible_by(current_ability, :index)
                                .order(name: :asc)
                                .page(params[:page])
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `color_themes` ORDER BY `color_themes`.`name` ASC LIMIT 25 OFFSET 0) subquery_for_count
SELECT `color_themes`.* FROM `color_themes` ORDER BY `color_themes`.`name` ASC LIMIT 25 OFFSET 0