app/controllers/admin/tenants_controller.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM `tenants` ORDER BY `tenants`.`name` ASC LIMIT 25 OFFSET 0) subquery_for_count
SELECT `tenants`.* FROM `tenants` ORDER BY `tenants`.`name` ASC LIMIT 25 OFFSET 0
---
    def index
      authorize! :index, Tenant

      @tenants = Tenant.accessible_by(current_ability, :index)
                       .order(name: :asc)
                       .page(params[:page])