app/controllers/admin/users/sessions_controller.rb

      def create
        @admin = User::Admin.find_by(email: allowed_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`type` = 'User::Admin' AND `users`.`email` = 'don@onehopecanada.ca' LIMIT 1